Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ ནི་ མི་ ཞེས་ བྱ་བ་ ལ་སོགས་པ་ རྒྱལ་པོ་ ལྔ་ བརྒྱ ས་ བྱས་པ་ ཡོད་ དེ
en: The stūpas had been constructed by five hundred kings, including King Nimi.

source: དེ འི་ ནང་ ན་ ཡང་ མཆོད་རྟེན་ འོག་ གི་ གདན་ གསེར་ ལས་ བྱས་པ །_ ཁོ་ར་ ཁོར་ཡུག་ ནས་ གསེར་འབར་ བས་ འཁོར་བ །_ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱིས་ མཛེས་པ ར་ བྱས་པ །_ འབུར་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_ སངས་རྒྱས་ ཀྱི་ ཐེག་པ འི་ ཚིག་ སྣ་ཚོགས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ ཞིག་ ཡོད་ ལ །_
en: The stūpas had foundations and surrounding ledges that were also made of shining gold, and they were adorned with the seven precious substances, various types of stucco, and edicts from the Buddha Vehicle.

source: མཆོད་རྟེན་ དེ་ ལ་ ཡང་ ཚལ་ དང་ །_ ནགས་ཚལ་ བྲིས་པ་ དག་ ཡོད་ དེ །_ སྔ་མ་ བཞིན་ ནོ །_།
en: They had also been decorated with drawings of forests and groves of the same kind as described before.

source: དེ འི་ ཚེ་ ན་ ཤིང་ ལྗོན་པ་ གང་དག་ སྒྲ་གཅན་ གྱི་ གནས་ སུ་ བྲིས་པ་ དེ་དག་ ཐམས་ཅད་ འཛམ་བུ འི་ གླིང་ ན་ ཡོད་ དེ །_ རི་མོ་ མཁན་ རྣམས་ ཀྱིས་ ཇི་ལྟ ར་ མཐོང་བ་ བཞིན་ དུ་ མཆོད་རྟེན་ དེ་ ལ་ བྲིས་ སོ །_།
en: All the trees that grow in the realm of Rāhu could in those days also be found here in Jambudvīpa, and artists had thus painted them accurately on the stūpas just as they had seen them.

source: རྫིང་བུ་ མང་པོ་ བྱས་པ་ གང་བ་ དག་ ཀྱང་ ཡོད་ དེ་ སྔ་མ་ བཞིན་ ནོ །_
en: The various ponds mentioned before were also painted on the stūpas.

source: དེ་ ལན་ཅིག་ གཅིག་ ཤིང་རྟ་ བཞི་ སྟོང་ དང་ ནགས་ ཁུང་ དེར་ སོང་ སྟེ །_ འགྲོན་པོ་ ནགས་ ཁུང་ དུ་ དོང་བ་ རྣམས་ ཀྱི་ ཕྱིར་ ཟས་ དང་ ཐུག་པ་ དང་ །_ ཆུ་ དག་ ཁྱེར་ རོ །_།
en: $89 “One time, when one thousand chariots were traveling through the deep forest, the brahmin#227 brought food, soup, and water to the travelers.

source: དེ་ནས་ རེ་ཞིག་ ན་ མཆོད་རྟེན་ འཕང་ དུ་ དཔག་ཚད་ གཉིས་ ཡོད་ ལ །_ ཆུ་ཞེང་ དུ་ རྒྱང་གྲགས་ ལྔ་ ཡོད་པ་ དེར་ མི་ སྡིག་ཅན་ ཞིག་ གིས་ གསར་ དུ་ མེ་ བཏང་ ནས་
en: At that time, however, an evil person set fire to a stūpa that was two leagues tall and five leagues wide, and the stūpa was about to burn down.

source: མེ་ དེས་ མཆོད་རྟེན་ དེ་ ཚིག་ ལ་ ཐུག་ སྟེ བྲམ་ཟེ་ དེས་ མེ་ ཤོར་བ་ དེ་ མཐོང་ ནས །_ དེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: Seeing that the stūpa had caught fire, the brahmin thought,

source: བདག་ ལ་ འདི འི་ བསོད་ནམས་ ཀྱང་ མི་ དགོས །_ འདི་ ཐམས་ཅད་ མཁྱེན་པ འི་ གནས་ ཀྱང་ མ་ ཡིན་མོད་ ཀྱི །_ འོན་ཀྱང་ འདི་ མཛེས་པ་ ཁོ་ན་ ཞིག་པ ས་ མེས་ ཚིག་ ན་ མི་ རུང་ ལ །_ རྒྱལ་པོས་ ཀྱང་ བདག་ ལ་ བཀའ་ གྱོད་ སྨྲ ར་ མེད་པར་ བྱ འོ་ སྙམ་ སྟེ
en: ‘I have no need for any of its merits, nor is this stūpa an abode of omniscience. Still, because of its beauty, it would be a shame if it burned down. Moreover, if I can save it, the king will surely not reprimand me.’

source: དེས་ དད་ ཅིང་ གུས་པ་ མེད་པར་ ཤིང་རྟ་ དེ་དག་ གིས་ ཆུ་ བསྐྱས་ ནས་ མཆོད་རྟེན་ དེ་ལས་ མེ་ བསད་ དེ །_
en: $90 “Thus, without any faith or reverence, he arranged for the chariots to carry water to extinguish the fire.

source: འདི་ལྟར་ དེས་ ཆེད་ ཆེ ར་ མི་ འཛིན་པ ར་ རྒོད་ བཞིན་ དུ །_ གལ་ཏེ་ འདི་ ལས་ བསོད་ནམས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ ཞིག་ ཡོད་ ན་ ནི །_
en: Not thinking much of what he had done, he later said with a laugh,

source: དེ་ རགས་པ་ ཞིག་ ཡིན་གྲང་ གིས །_ དེ འི་ རྣམ་པར་ སྨིན་པ ས །_ ཅི་ ནས་ ཀྱང་ འདོད་པ འི་ ཁམས་ ན་ བདག་ ལས་ ལུས་ ཆེ་བ་ གཞན་ མེད་པ་ ཙམ་ དུ་ གྱུར་ཅིག་ ཅེས་ བྱས་ ཏེ
en: ‘Should there be any meritorious ripening from having done this act, it may be rather coarse. Therefore, by the ripening of this, may I become the being with the largest body within the desire realm.’

source: དད་པ་ མེད་པ་ དང་ །_ སེམས་པ་ མེད་པ་ དང་ །_ [13a] རྟག་ ཏུ་ འཐབ་པ ར་ སེམས་པ འི་ ཕྱིར །_ ལས་ དེ འི་ མཐུ ས་ སེམས་པ་ མེད་པ འི་ ལས་ དེ འི་ འབྲས་བུ་ ཞིང་ དམ་པ འི་ བསོད་ནམས་ ལས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ར་ སྐྱེས་པ ར་ མཐོང་ ངོ་ །_།
en: Thus, he made this wish without faith or proper attention, [13.a] and under the influence of his competitive nature. By the power of that act—as the result of such mindless action as well as the ripening of such true merits—he was born as the lord of the asuras.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ སྒྲ་གཅན་ གྱི་ ཡུལ་ ས་ གཞན་ ཡང་ ཇི་ཙམ་ ཞིག་ ཡོད་ ཅེས་ དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ འམ །_
en: $91 “Next, the monk who has knowledge of the ripening of karmic action will ask himself what further lands of the asuras might exist beyond the residence of Rāhu.

source: ལྷ འི་ མིག་ གིས་ བརྟགས་ ན ས་གཞི་ དཔག་ཚད་ ཁྲི་ སུམ་ སྟོང་ ཡོད་ དེ །_ གསེར་ གྱི་ ས་གཞི་ ལ་ ཚལ་ དང་ །_
en: Examining this matter with knowledge derived from hearing or through the divine eye, he will perceive a golden ground that measures thirty million leagues.

source: ནགས་ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ རྫིང་ དང་ །_ བྱ་ དང་ །_ ཤིང་ ལྗོན་པ་ དང་ །_ ཁྱིམ་ དང་ །_ གྲོང་ཁྱེར་ དང་ །_ གླིང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ ས་ གང་བ་ དང་ །_ ནོར་བུ་ མང་པོ་ དང་ ལྡན་པ འི་ ཐང་ བུད་མེད་ གདུ་བུ ས་ བརྒྱན་པ་ བཞིན་ དུ་ མཛེས་པ་ དེ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དབང་ བྱེད་ ཅིང་ དགྲ་ཟླ་ མེད་ ལ །_
en: This land features groves, forests, ponds, pools, birds, trees, houses, cities, islands, and a plateau filled with asurīs and numerous jewels. Adorned with bracelets, these beautiful women are all courtesans of Rāhu alone, and he has no rival.

source: རང་ དགར་ བྱེད་ ཅིང་ གར་ དགའ་བ ར་ འགྲོ་བ་ དང་ །_
en: Thus, he sports and circulates among them as he pleases.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ འི་ ཡུལ་ ས་ དེ་ ན་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ཡུལ་ བཅུ་གསུམ་ ཡོད་ དེ དེ་ ན་ ལྷ་མ་ ཡིན་ རྣམས་ གནས་ སོ །_། དེ་ རྣམས་ ཀྱི་ མིང་ ལ་ འདི་ལྟ་སྟེ །_
en: This land of the lord of the asuras contains thirteen asura realms inhabited by classes of asuras that are known by the following names:

source: ཟ་བ་པོ་ རྣམས་ དང་ །_ རབ་ཏུ་ རྒྱུག་པ་ རྣམས་ དང་ །_ ནད་ གཏོང་བ་ ལ་ དགའ་བ་ རྣམས་ དང་ །_ ནོར་བུ འི་ དོ་ཤལ་ ཐོགས་པ་ རྣམས་ དང་ །_ བུང་བ་ ལྟར་ འཁྱིལ་པ་ རྣམས་ དང་ །_ མིག་དམ ར་བ་ རྣམས་ དང་ །_ ཀུན་ ཏུ་ རྒྱུག་པ་ རྣམས་ དང་ །_ ཆུ་ ན་ གནས་པ་ རྣམས་ དང་ །_ ནམ་མཁའ་ ལ་ གནས་པ་ རྣམས་ དང་ །_ ལྷུན་པོ འི་ ཁང་ ན་ གནས་པ་ རྣམས་ དང་ །_ ལྟེང་ཀ་ སྡུག་གུ་ རྣམས་ དང་ །_ ཉ་ གདོང་པོ་ རྣམས་ དང་ །_ ལམ་ ཆེན་ ལྡན་ རྣམས་ སོ །_།
en: eaters, roamers, those fond of causing disease, crystal holders, those who swarm like bees, red-eyed ones, runners, water dwellers, space dwellers, mountain mansion dwellers, ponds of beauty, fish faces, and highway possessors.

source: དེ་དག་ གི་ འཕེལ་འགྲིབ་ ནི་ གང་ གི་ ཚེ་ སྐྱེ་དགུ་ རྣམས་ དགེ་སྦྱོང་ དུ་ མི་ འཛིན །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ་ དེ འི་ ཚེ་ ནི་ ལྷ འི་ ཕྱོགས་ ནི་ འགྲིབ་པ ར་ འགྱུར་ ལ །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ འཕེལ་བ ར་ འགྱུར་ ཏེ །_
en: $92 “These asuras flourish and decline in the following way. When people do not respect mendicants and do not respect brahmins, the forces of the gods weaken, while the forces of the asuras gain strength.

source: དེ འི་ ཚེ་ ཆོས་ དང་ མི་ ལྡན་པ་ རྣམས་ ནི་ ཆེས་ མཐུ་ ཆེ་ ལ །_ ལྷ་ རྣམས་ ནི་ ཞན་པ ར་ འགྱུར་ རོ །_།
en: At such times, unrighteous beings become extremely powerful and the gods grow weak.

source: གང་ གི་ ཚེ་ སྐྱེ་དགུ་ རྣམས་ དགེ་སྦྱོང་ དུ་ འཛིན་ ཅིང་ བྲམ་ཟེ ར་ འཛིན་པ་ དེ འི་ ཚེ་ ནི །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ འགྲིབ་པ ར་ འགྱུར་ ལ །_ ལྷ འི་ ཕྱོགས་ ནི་ འཕེལ་བ ར་ འགྱུར་ ཏེ
en: When people respect mendicants and respect brahmins, however, the forces of the gods will grow, and the forces of the asuras will weaken.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ [13b] གཉིས་ ཀྱི་ འཕེལ་འགྲིབ་ ནི་ དེ་ལྟ ར་ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ ལ་ རག་ ལས་ སོ །_།
en: [13.b] Thus the success and failure of both gods and asuras depend on Dharma and non-Dharma.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་སྒྲ་ གཅན་ གྱི་ ཡུལ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ལས་ དང་ ཆོས་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $93 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will examine the karmic action and destiny of those asuras who live in the realm of Rāhu.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་རབ་ ཀྱིས་ བརྟགས་ ན །_ གང་དག་ གིས་ དུད་འགྲོ་ རྣམས་ ལ་ སྲོག་ གི་ སྦྱིན་པ་ བྱས་ ཏེ །_ ཉ་ རྣམས་ གསོན་པ ར་ བྱ་བ འི་ ཕྱིར །_ ཉ་བ འི་ རྒྱ་ རྣམས་ དྲལ་བ་ དང་ །_ གང་དག་ གིས་ རྙེད་པ་ འདོད་པ འི་ ཕྱིར་ རམ །_ གྲགས་པ་ འདོད་པ འི་ ཕྱིར་ རམ །_ རྒྱལ་པོས་ བཀའ་ སྩལ་པ འི་ ཕྱིར་ རམ །_ རིགས་ ཀྱི་ ཆོས་ལུགས་ སུ་ ཡོད་པ འི་ ཕྱིར་ སྲོག་ཆགས་ ལེགས་པ ར་ བསྲུངས་ ལ །_
en: He will then see that they are beings who previously protected the lives of animals, released fish from their nets to keep them alive, or who protected the lives of others motivated by a desire for wealth, fame, or royal favors, or due to observing the religious duties of their family. However, while doing so, these people also engaged in a great number of unwholesome activities.

source: ལྷག་མ་ གཞན་ ནི་ ཆོས་མ་ ཡིན་པ་ ཐམས་ཅད་ བྱེད་པ་ དེ་དག་ ལུས་ དང་ བྲལ་བ འི་ འོག་ ཏུ་ ངན་སོང་ ལོག་པ ར་ ལྟུང་བ་ སྒྲ་གཅན་ གྱི་ ཡུལ་ དུ་ ལྷ་མ་ ཡིན་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ཏེ
en: Therefore, when such people separate from their bodies, they will fall into the lower realms and take birth as asuras in the realm of Rāhu.

source: དེ་དག་ གི་ ཚེ འི་ ཚད་ ཀྱི་ ཁྱད་པར་ ནི་ མི་ རྣམས་ ཀྱི་ ལོ་ ལྔ་ བརྒྱ་ གང་ཡིན་པ་ དེ་དེ་ དག་ གི་ ཉིན་ཞག་ གཅིག་ ཏུ་ རྩི་བ་ དེ་ལྟ་ བུ འི་ ལོ་ ལྔ་ སྟོང་ ཐུབ་ སྟེ །_
en: There, they will live with a lifespan of five thousand asura years, of which one day lasts five hundred human years.

source: བར་མ་དོ ར་ འཆི་བ་ ནི་ ཡོད་ དོ །_།
en: It is possible, however, that they will die prematurely.

source: རབ་ འབྲིང་ དུ་ འགྱུར་བ་ ནི་ སེམས་ ལ་ རག་ ལས་ སོ །_།
en: Whether they live in good or mediocre circumstances depends on their states of mind.

source: བོང་ ཚོད་ དང་ཁ་ དོག་ དང་ མཐའ་ ཡང་ ལས་ དང་ ཆོས་ ལ་ རག་ ལས་ ཏེ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ དང་ མོས་པ་ སྣ་ཚོགས་ ལས་ འགྱུར་ རོ །།_།།
en: As for their size, colors, and height, these all depend on their actions and destinies, which are determined by the various attitudes and inclinations of sentient beings.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ རྒྱ་མཚོ འི་ གཏིང་ སྒྲ་གཅན་ གྱི་ ས་གཞི་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $94 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will examine the depths of the ocean in the land of Rāhu.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ་ ཤིན་ཏུ་ གསལ་ ཞིང་ རྣམ་པར་ དག་པ ས །_ སྒྲ་གཅན་ གྱི་ ས་གཞི འི་ འོག་ ན་ ས་གཞི་ གཉིས་པ་ ཡུལ་ ས་ ཐ་དད་པ་ ཟླ་བ འི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ དཔག་ཚད་ ཉི་ཁྲི་ ཆིག་སྟོང་ ཡོད་པ་ ཇི་ལྟ ར་ འདུག་པ་ མཐོང་ ངོ་ །_།
en: Inquiring with extremely bright, pure knowledge derived from hearing, he will accurately see how a second plateau exists below that of Rāhu. There, extending for twenty-one thousand leagues, is a distinct realm known as Moon Garland.

source: དེ་ ན་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ གནས་པ་ ལྷ་མ་ ཡིན་ དེ་ རྣམས་ ཀྱི་ བདག་པོ་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ ཞིག་ ཡོད་ དེ །_
en: This realm is inhabited by the so-called necklaces, a class of asuras ruled by their lord, Kaṇṭhamāla.

source: ས་གཞི་ དེ་ ན་ གཉིས་ ཤིང་ རྩེ་བ་ ཞེས་ བྱ་བ འི་ གྲོང་ཁྱེར་ དཔག་ཚད་ བརྒྱད་ སྟོང་པ་ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ ལྡན་པ་ པད་མ འི་ རྫིང་ དང་ །_ འབབ་ཆུ་ དང་ །_ རི་སུལ་ དང་ །_ གསེར་ གྱི་ རི་བོ་ [14a] དང་ །_ གསེར་ གྱི་ བྲག་ དང་ །_ ཕ་བོང་ དང་ །_ བྱ་སྐྱིབས་ དང་ །_ རི་ དག ས་ དང་ །_ བྱ་སྤུ་ སྡུག་གུ་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_
en: Also found in that realm is the city known as Double Pleasure.#228 Measuring eight thousand leagues, the city is adorned with groves, forests, pools, lotus ponds, waterfalls, mountains, golden mountains, [14.a] golden rocks, boulders, rock shelters, wild animals, and feathery birds.

source: བཻ་ ཌཱུརྱའི་ ས་གཞི་ དང་ །_ གསིང་མ་ མདོག་ སྡུག་གུ ས་ མཛེས་པ ར་ བྱས་པ །_
en: The ground is made of beryl and carpeted with beautiful meadows.

source: བྱ་ སྣ་ཚོགས་ སྐད་ སྙན་པ་ འབྱིན་པ་ ལྷ་མ་ ཡིན་ གྱི་ ཚོགས་ མང་པོ་ ཡུལ་ གྱི་ སྐྱེ་བོ་ འབྱོར་པ ས་ གང་བ་ ཀུན་ ནས་ རིན་པོ་ཆེ་ སྣ་ བདུན་ མཆོག་ ཏུ་ ཡིད་ དུ་ འོང་བ ས་ བརྒྱན་པ །_
en: Various species of birds chirp delightfully, and the asuras who live there have abundant wealth. Thus, they wear exquisite jewelry made of perfect pieces of the seven precious stones and metals.

source: ཤིང་ ལྗོན་པ་ དག་ གིས་ སྔ་མ་ བཞིན་ དུ་ མཛེས་པ ར་ བྱས་པ །_
en: $95 “The city’s trees are beautiful, as mentioned before.

source: ཀླུ འི་ མེ་ཏོག་ དང་ །_ ཀླུ འི་ ཤིང་ མྱ་ངན་ འཚང་ དང་ །_ ཤིང་ དྷ་བ་ དང་ །_ སེང་ལྡེང་ དང་ །_ རྒྱ་སྐྱེགས་ ཀྱི་ ཤིང་ སྣ་ཚོགས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_
en: There are nāga flowers, nāga aśoka trees, axlewood, teak trees, flame-of-the-forest, and so forth.

source: དེ་ ན་ ཤིང་ ལྗོན་པ འི་ སྣ་གྲངས་ འདི་ ལྟ་བུ་ དག་ ལྷག་པ ར་ མང་ དུ་ཡོད་ དེ་
en: There are also a great number of other trees, such as niśa, prahasa, itiniśa, bagu, and nitanata. These trees are filled with delightful blooming flowers.

source: འདི་ལྟ་སྟེ །_ ནི་ ཤ་ དང་ །_ པྲ་ ཧ་ས་ དང་ །_ ཨི་ ཏི་ ནི་ ཤ་ དང་ །_ བ་ གུ་ དད་ དང་ །_ ནི་ ཏན་ ཏ་ དང་ །_ མེ་ཏོག་ ལྗིད་ དང་ །_ ཀུན་ ཏུ་ དགའ་ དང་ །_ མེ་ཏོག་ རྒྱས་ དང་ །_ ལྗིད་ ཀྱིས་ ནོན་ དང་ །_ ལོ་ ལྔ་ ཞིང་ མེ་ཏོག་ འབྱུང་བ་ དང་ །_ བུང་བ་ མངོན་དགའ་ དང་ །_ སྒྲ་ འུར་འུར་ དང་ །_ བྱ་སྐད་ ཅ་ཅོ་ ཅན་ དང་ །_
en: They are lavish and grow five types of leaves and flowers, which are cherished by humming bees and singing birds alike.

source: དཀར་པོ ར་ སྣང་ དང་ །_ ལོ་མ ས་ རྒྱས་ རྣམས་ ཏེ །_
en: With their rich foliage, they shimmer brightly.

source: གཉིས་ ཤིང་ རྩེ་བ འི་ གྲོང་ཁྱེར་ དེ་ ན་ ཤིང་ ལྗོན་པ འི་ སྣ་གྲངས་ དེ་ལྟ་ བུ་ དེ་དག་ ལྷག་པ ར་ མཐོང་ ངོ་ །_།
en: All these many trees can be seen in the city of Double Pleasure.

source: གྲོང་ཁྱེར་ དེ་ཡང་ གསེར་ གྱི་ རི་རྩེ་ བཞི་པ འི་ དབུས་ ན་ འདུག་ སྟེ །_
en: $96 “Centrally located, the city lies between four golden mountains:

source: འདི་ལྟ་སྟེ །_ རི འི་ རྩེ་མོ་ དགའ་བྱེད་ དང་ །_ རི འི་ རྩེ་མོ་ ལྷང་ ཚེ ར་ དང་ །_ རི འི་ རྩེ་མོ་ རྩེ་ མི་ སྣང་ དང་ །_ རི འི་ རྩེ་མོ་ ཡིད་འོང་ གསེར་ ཞེས་ བྱ་བ་ རྣམས་ ཏེ །_
en: Delightful Summit, Abhrakrama Summit, Invisible Summit, and Gorgeous Gold Summit.

source: དེ་དག་ ཀྱང་ ཀུན་ ནས་ འཕང་ དུ་ དཔག་ཚད་ ལྔ་ སྟོང་ ཡོད་ དོ །_།
en: Each of them towers five thousand leagues in height.

source: དེ་དག་ གི་ ཚལ་ རྣམས་ ཀྱང་ འབབ་ཆུ་ དང་ །_ ཆུ་བོ་ དང་ །_ ཆུ་ བསིལ་ དང་ །_
en: In their beautiful forests lie waterfalls, rivers, and cool ponds.

source: རི་ དག ས་ ཀྱི་ ཚོགས་ ཁ་དོག་ རྣམ་པ་ སྣ་ཚོགས་ ཅན་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_ སྐྱེས་པ་ དང་ །_ བུད་མེད་ ཀྱི་ ཚོགས་ རྟག་ ཏུ་ དགའ་བ་ རྣམས་ ཀྱིས་ གང་བ །_
en: Herds of deer of sundry colors roam therein, while the men and women enjoy constant and abundant pleasures.

source: རིན་པོ་ཆེ འི་ སྒོ་ སྣ་ཚོགས་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_ ཙན་དན་ ས་མཆོག་ གི་ ཤིང་ ལྗོན་པ་ འདུད་པ འི་ རླུང་ ལྟར་ རྟག་ ཏུ་ བསིལ་ ཞིང་ དྲི་ཞིམ་པ་ རྣམས་ ཀྱིས་ ཉེ་བ ར་ འཚོ་བ །_
en: The beautiful gates are made of precious stones and metals and the forests are continually fanned by cool, fragrant, healing breezes that whisper through the delightful sandal trees.

source: མེ་ཏོག་ གི་ རྣམ་པ་ དག་ གིས་ རྟག་ ཏུ་ བརྒྱན་པ །_ རྨ་བྱ་ འབུམ་ཕྲག་ དུ་མ་ སྒྲ་སྙན་པ་ འབྱིན་པ །_
en: The flowers there are always in bloom and one hears the melodious cries of the many hundreds of thousands of peacocks.

source: ལྷ་མ་ ཡིན་ ཆེན་པོ ས་ བསྐྱངས་པ །_ གྲང་བ་ དང་ ཚ་བ ས་ ཉམས་པ་ [14b] མེད་ ལ །_
en: The land is guarded by great asuras and the temperature is never unpleasant. [14.b]

source: སྐྱེ་བོ་ རབ་ཏུ་ དགའ་བ ས་ རྟག་ ཏུ་ གང་བ །_ རོལ་མོ འི་ སྒྲ་ དང་ །_ གླུ་ དང་ །_ བྲོ་ དང་ །_ དགོད་པ ས་ རྟག་ ཏུ་ དགའ་བ་ ཡིན་ ནོ །_།
en: Everywhere are found happy individuals, who enjoy themselves with music, song, dance, and laughter.

source: ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ ཆེན་པོ་ སྐུར་ ཕྲེང་ དེ་དག་ གི་ དབུས་ ན་ མཚོ་ཆེན་པོ་ ཀུན་ ནས་ཆུ་ དང་ ཞེང་ དུ་ དཔག་ཚད་ ལྔ་ ཡོད་པ །_
en: $97 “In the center of the great asura city known as Star Garland lies a water basin that measures five leagues.

source: རབ་ཏུ་ དང་བ །_ རོ་ ཤིན་ཏུ་ ཞིམ་པ །_ འདམ་རྫབ་ དང་ །_ རྙོག་པ་ མེད་པ །_ ཆུ་ རྟག་པ །_ ཟླ་བ་ གཉིས་པ་ ལྟར་ རབ་ཏུ་ གསལ་བ་ ཡིན་ ནོ །_།
en: Its water is clear, delicious, free of mud and other impurities, constantly present, and radiant like a second moon.

source: སྐར་ ཕྲེང་ གི་ དབུས་ ན་ མཚོ་ ཡོད་པ་ གང་ཡིན་པ་ དེ་ ནི་ ཀུན་མཐོང་ ཞེས་ བྱ་ ལ །_ དེ འི་ མཐུ་ ནི་ འདི་ ལྟ་བུ་ ཡིན་ ཏེ །_
en: This basin in the center of Star Garland is known as Mirror Lake, and its powers are as follows.

source: གང་ གི་ ཚེ་ལྷ་མ་ ཡིན་ གཡུལ་འགྱེད་ པར་ བྱེད་པ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ མཚོ་ ཀུན་མཐོང་ དེར་ འགྲོ་བ ར་ བྱེད་ དོ །_།
en: Before the asuras march to the battlefield, the necklace asuras first proceed to Mirror Lake.

source: དེ་དག་ མཚོན་ཆ་ དང་ །_ གོ་མཚོན་ སྣ་ཚོགས་ ཐོགས་ ནས་ གཡུལ་འགྱེད་པ འི་ ལྟས་ བལྟ་བ འི་ ཕྱིར་ མཚོ་ དེ་ ཡོངས་སུ་ བསྐོར་ ནས་ འཁོད་ དོ །_།
en: Holding their weapons and helmets, they will line up on the shores of the lake and stare into its waters, watching for any omens concerning their military fortune.

source: དེ་དག་ གི་ གཟུགས་བརྙན་ དེ་དག་ ཇི་ལྟ ར་ མེ་ལོང་ གཡའ་ མེད་པ འི་ ནང་ ན །_ གཟུགས་བརྙན་ སྣང་བ་ དེ་ལྟ ར་ མཚོ་ དེ འི་ ནང་ ན་ སྣང་ངོ་ །_།
en: As if they were gazing into a spotless mirror, they will see their reflections standing clearly in the lake.

source: དེ་དག་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ དུ་ གལ་ཏེ་ ཕམ་པ ར་ གྱུར་ ན །_ མཚོ་ དེ འི་ ནང་ དུ་ རང་རང་ གི་ གཟུགས་བརྙན་ དེ་དག་ འབྲོས་པ ར་ སྣང་ངོ་ །_།
en: If they are about to lose the upcoming battle with the gods, the asuras reflected in the lake will appear to be fleeing.

source: གང་དག་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་འགྱེད་པ་ དེར་ འཆི་བ ར་ འགྱུར་ ན་ ནི་ རང་རང་ གི་ གཟུགས་བརྙན་ མཚོ་ དེ འི་ ནང་ ན་ འཆི་བ ར་ སྣང་ངོ་ །_།
en: And if they are about to die on the battlefield, they will see themselves dead in the lake.

source: ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ བདག་པོ་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ གང་ཡིན་པ་ དེ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ འདོད་པ འི་ ཀླུང་ ཞེས་ བྱ་བ་ ན་ འདུག་པ་ གང་ཡིན་པ་ དེ་ འབྲོས་པ་ དང་ །_ ངེས་པ ར་ འཆི་བ ར་ འགྱུར་བ་ དེ་ལྟ ར་ མཚོ་ དེ འི་ ནང་ དུ་ མཐོང་ ངོ་ །_།
en: $98 “In this manner, the asura king Kaṇṭhamāla and the asura leader who resides in the asura city called Desired Wind, may see themselves fleeing or dead in the lake.

source: དེ་དག་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: When that happens, they will wonder,

source: གང་ གིས་ བདག་ཅག་ ཀུན་མཐོང་ གི་ མཚོ འི་ ནང་ དུ་ ལྷ་ རྣམས་ ལས་ ཕམ་ ཞིང་ ཉམས་པ ར་ འགྱུར་བ་ མཐོང་བ འི་ རྒྱུ་ གང་ཡིན་ རྐྱེན་ གང་ཡིན་ སྙམ་ བྱེད་ དོ །_།
en: ‘What are the causes and conditions that enable us to see within Mirror Lake whether we will be defeated and killed at the hands of the gods?’

source: དེ་ནས་ ཡང་ དེ་ རྣམས་ གྲོང་ཁྱེར་ དེ་དག་ ཏུ་ དོང་ སྟེ །_
en: They will then return to their cities.

source: ལོ་ བརྒྱ་ ལོན་ ནམ །_ ལོ་ ལྔ་ བརྒྱ་ ལོན་ ནམ །_ དེ་ལྟ ར་ ལོ་ བཅུ་ ལོན་ ནམ །_ དེ་ནས་ ཡང་ མཚོ་ ཀུན་མཐོང་ ག་ལ་ བར་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ ལྷན་ཅིག་ དོང་ སྟེ
en: $99 “Then, when either a hundred years, five hundred years, or ten years have passed, the necklace asuras, together with the asura king called Firm, will approach the lake.

source: དེ་ལྟ ར་ མཚོན་ཆ་ དང་ །_ གོ་མཚོན་ སྣ་ཚོགས་ ཐོགས་པ །_ ཆ་བྱད་ དང་ །_ མེ་ཏོག་ ཕྲེང་ དང་ །_ ཕྱེ་མ་ དང་ །_ བྱུག་པ ས་ ལུས་ བསྐུས་ [15a] པ་ དེ་དག་ མཚོ་ ཀུན་མཐོང་ དེ་ ཡོངས་སུ་ བསྐོར་ ནས་ འཁོད་ དོ །_།
en: Brandishing their weapons and helmets, donning their military attire, adorned with flowers and colored powders, and with their bodies slathered in ointments, [15.a] the asuras will line up, surrounding the shores of the lake.

source: དེ་ནས་ ཡང་ མཚོ་ ཡོངས་སུ་ བསྐོར་བ་ དེ་དག་ ཉིད་ ཀྱིས་ མཚོ་ དེ འི་ ནང་ དུ་ འཛམ་བུ འི་ གླིང་ གི་ མི་ མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_ ལྷ་ དང་ འཐུན་ པར་ སྒྲུབ་པ་ དེ་དག་ ཤི་ ནས་ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: As they look at the surface of the water, they will first see how the human beings of Jambudvīpa who respect their fathers, their mothers, mendicants, and brahmins are born as gods once they die.

source: དེ་ནས་ མཚོ་ དེ འི་ ནང་ དུ་ ལྷ འི་ ཕྱོགས་ ནི་ རྒྱལ་བ ར་ འགྱུར །_
en: Next, they will see how the battalions of the gods are victorious, and how the battalions of the asuras are defeated.

source: ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ ཕམ་པ ར་ འགྱུར་བ་ མཐོང་བ་ དང་ །_ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ཞེས་ བྱ་བ་ དེ་དག་ འདི་ སྙམ་ སེམས་ ཏེ །_
en: $100 “At this point the necklace asuras and the asura king Firm will think,

source: ཀྱེ་མ་ ལྷ་ རྣམས་ ནི་ མི་ལ་ རག་ ལས །_
en: ‘Ah! The gods depend on humans.

source: མི འི་ ཁ་ ན་ ལས །_ མི་ལ་ རྟེན་པ་ ཡིན་ ཏེ །_
en: The problem is humans,#229 for they are the supporters of the gods.

source: བདག་ཅག་ གིས་ གང་ མི་ རྣམས་ ལ་ མི་ ཕན་པ་ དང་ །_ མི་ བདེ་བ ར་ བྱ་བ འི་ ཕྱིར་ འབད་པ་ དང་ །_
en: Rather than help the humans, let us do what we can to make them unhappy.

source: དེ་དག་ ཉམས་པ ས་ ལྷ་ རྣམས་ ཀྱང་ ཐུབ་པ ར་ འགྱུར་ རོ་ སྙམ་ དུ་ དེ་ལྟ ར་ བསམས་ ནས
en: When the humans have been brought down, we will be able to defeat the gods.’

source: ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དག་ སེམས་པ ར་ བྱེད་ དེ །_
en: $101 “Further, the necklace asuras and the asura king Firm will think,

source: འདི་ལྟར་ མི་ རྣམས་ ནི་ ཁ་ཟས་ ལ་ རག་ ལས་ཤིང་ རྟེན་པ་ ཡིན་ ཏེ །_
en: ‘Humans depend on and are supported by food.

source: མི་ དེ་ རྣམས་ ཀྱི་ ཁ་ཟས་ ཆུད་ གསན་པ་ ལ་ འབད་པ ར་ བྱ འོ་ སྙམ་ ནས །_
en: Therefore, let’s do what we can to make their food run out.’

source: དེ་དག་ གིས་ དེ་ལྟ ར་ ཤེས་ ནས་ རྒྱ་མཚོ འི་ ནང་ ན་ ཀླུ་ ཆོས་ དང་ མི་ ལྡན་པ་ ཁྲོ་བ འི་ ཤས་ ཆེ་བ །_ རྟག་ ཏུ་ གནོད་པ འི་ བསམ་པ་ ཅན་ འཁོད་པ་ གང་ཡིན་པ་ དེ་དག་ ལ་ སྨྲ་བ ར་ བྱེད་ དེ
en: $102 “With such thoughts in mind, they will turn to the unvirtuous, aggressive, and constantly malicious nāgas of the sea.

source: འདི་ལྟ་སྟེ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ནག་པོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བསྒྱིངས་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཧུ་ ལུ་ ཧུ་ ལུ་ སྟེ །_ དེ་དག་ ལ་སོགས་པ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ རྣམས་ ལ །_ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ ན་རེ །_
en: Speaking to Pramatha, Kāla, Aṭopa, Huluhulu, and other such unvirtuous and unrighteous nāga kings, the necklace asuras will say,

source: འདི་ལྟར་ ཁྱེད་ཅག་ ལ་ རག་ ལས་པ འི་ མི་ དེ་དག་ ནི་ ལྷ འི་ ཕྱོགས་ ཡིན་ ལ །_ དེ་དག་ གི་ སྲོག་ ཀྱང་ ཁ་ཟས་ ཀྱིས་ འཚོ འོ །_།
en: ‘The humans who depend on you have taken the side of the gods, but they need food to stay alive.

source: ཁྱེད་ཅག་ ལ་ རག་ ལས་པ་ ཁ་ཟས་ ཀྱིས་ འཚོ་བ འི་ མི་ དེ་དག་ ཇི་ལྟ ར་ མེད་པར་ འགྱུར་བ་ དེ་ལྟ ར་ གྱིས་ ཤིག _།
en: Do what you can to destroy all the humans, who depend on you and stay alive based on food.

source: གང་ གི་ ཕྱིར་ འདི་ལྟར་ ཁྱེད་ཅག་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ ཤིན་ཏུ་ དགྲ ར་ གྱུར་པ་ ལྟར་ བདག་ཅག་ དང་ ལྷ་ རྣམས་ ཀྱང་ དེ་ལྟ་ བུ་ ཡིན་ ཏེ
en: Destroy them, because just as nāga kings such as Vāsuki and Takṣaka are your bitter enemies, so the gods are our enemies.

source: ཁྱེད་ཅག་ གིས་ བདག་ཅག་ གི་ གྲོགས་ བྱ་བ་ དེ་ ནི་ [15b] རིགས་པ་ ཡིན་ ནོ་ ཞེས་ སྨྲས་ སོ །_།
en: You ought to come and help us.’ [15.b]

source: དེ་ནས་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དག་ གི་ ཚིག་ ཐོས་ ནས་ ཆོས་ དང་ མི་ ལྡན་པ འི་ ཀླུ་ རྣམས་ ཀྱིས་
en: $103 “When they hear these words from the asura kings, the unrighteous nāgas will reply,

source: བདག་ཅག་ དང་ ཁྱེད་ཅག་ ཕྱོགས་ འཐུན་པ་ ཡིན་ ཏེ དེ་ལྟ ར་ བྱ འོ་ ཞེས་ སྨྲས་ ནས་ དེ་དག་ ནི་ རང་ གི་ གནས་ སུ་ དོང་ ངོ་ །_།
en: ‘We are your allies. We shall do just that.’

source: ཀླུ འི་ རྒྱལ་པོ་ ཁྲོ་བ ས་ གདུངས་པ་ རྣམས་ ཀྱང་ གནས་ སུ་ དོང་ ནས །_ གལ་ཏེ་ ཆུ་ དཔག་ཚད་ བརྒྱ ར་ གཡོ་ བར་ བྱེད་ དེ །_ གལ་ཏེ་ དཔག་ཚད་ ཉིས་ བརྒྱ ར །_ གལ་ཏེ་ དཔག་ཚད་ སུམ་བརྒྱ ར་ གཡོ་ བར་ བྱེད་ དོ །_།
en: The nāgas, afflicted by anger, will then leave their abodes, thereby stirring the waters within a distance of one hundred, two hundred, or three hundred leagues.

source: ཆུ འི་ སྟེང་ ན་ ནི་ ས་ འདུག་ སྟེ །_ གང་ གི་ ཚེ་ ཀླུ་ སྡང་བ་ རྣམས་ ཀྱིས་ ཆུ་ གཡོ་ བར་ བྱེད་པ་ དེ འི་ ཚེ་ཆུ་ གཡོས་པ ས་ ས་གཡོ་ བར་ བྱེད་ ལ །_ ཕྱོགས་ དེ འི་ ཆུ འི་ ཚད་ ཇི་ཙམ་ དུ་ གཡོ་ བར་ བྱེད་པ་ དེ་ཙམ་ དུ་ ས་གཡོ་ བར་ བྱེད་ དེ
en: Upon the water there is earth, and when the nāgas thus stir up the sea, the earth will tremble as well—the earth will quake as far as the waves reach.

source: ཀླུ་ སྡང་བ་ ཁྲོ་བ ས་ གདུངས་པ་ རྣམས་ ཀྱི་ མཐུ་ ནི་ དེ་ལྟ་ བུ་ ཡིན་ ནོ །_།
en: Such is the power of aggressive nāgas, afflicted by anger.
